turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c32/atdf/ATSAM4C32C_0.atdf
        <register caption="SMC Nand Flash Chip Select Configuration Register" name="MATRIX_SMCNFCS" offset="0x011C" rw="RW" size="4">
          <bitfield caption="SMC NAND Flash Chip Select 0 Assignment" mask="0x00000001" name="SMC_NFCS0"/>
          <bitfield caption="SMC NAND Flash Chip Select 1 Assignment" mask="0x00000002" name="SMC_NFCS1"/>
          <bitfield caption="SMC NAND Flash Chip Select 2 Assignment" mask="0x00000004" name="SMC_NFCS2"/>
          <bitfield caption="SMC NAND Flash Chip Select 3 Assignment" mask="0x00000008" name="SMC_NFCS3"/>
          <bitfield caption="SMC Selection for EBI pins" mask="0x80000000" name="SMC_SEL"/>
        </register>
        <register caption="Core Debug Configuration Register" name="MATRIX_CORE_DEBUG" offset="0x0128" rw="RW" size="4">
          <bitfield mask="0x00000002" name="CROSS_TRG1"/>
          <bitfield mask="0x00000004" name="CROSS_TRG0"/>
        </register>
        <register caption="Write Protection Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect Key" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module caption="Peripheral DMA Controller" name="PDC" version="6031F">
      <register-group name="PDC">
        <register caption="Receive Pointer Register" name="PERIPH_RPR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PERIPH_RCR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="PERIPH_TPR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="PERIPH_TCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PERIPH_RNPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PERIPH_RNCR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="PERIPH_TNPR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="PERIPH_TNCR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PERIPH_PTCR" offset="0x20" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PERIPH_PTSR" offset="0x24" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
    </module>
    <module caption="Parallel Input/Output Controller" name="PIO" version="11004K">
      <register-group name="PIO">
        <register caption="PIO Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4">
          <bitfield caption="PIO Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Disable Register" name="PIO_ODR" offset="0x0014" rw="W" size="4">
          <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Status Register" name="PIO_OSR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Glitch Input Filter Enable Register" name="PIO_IFER" offset="0x0020" rw="W" size="4">
          <bitfield caption="Input Filter Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Filter Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Filter Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Filter Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Filter Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Filter Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Filter Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Filter Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Filter Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Filter Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Filter Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Filter Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Filter Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Filter Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Filter Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Filter Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Filter Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Filter Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Filter Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Filter Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Filter Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Filter Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Filter Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Filter Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Filter Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Filter Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Filter Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Filter Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Filter Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Filter Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Filter Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Filter Enable" mask="0x80000000" name="P31"/>
        </register>
