turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c32/atdf/ATSAM4C32C_0.atdf
        <register caption="Host Pipe Configuration Register (n = 0) 3" name="UOTGHS_HSTPIPCFG3" offset="0x50C" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 4" name="UOTGHS_HSTPIPCFG4" offset="0x510" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 0" name="UOTGHS_HSTPIPISR0" offset="0x530" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 1" name="UOTGHS_HSTPIPISR1" offset="0x534" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 2" name="UOTGHS_HSTPIPISR2" offset="0x538" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 3" name="UOTGHS_HSTPIPISR3" offset="0x53C" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 4" name="UOTGHS_HSTPIPISR4" offset="0x540" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
